<template>
  <div class="min-h-screen">
    <div class="bg-white px-4 py-20">
      <div class="mx-auto max-w-4xl">
        <CommonAtomsTopicPath>
          <template #currentPath_name>プライバシーポリシー</template>
        </CommonAtomsTopicPath>
        <div>
          <h1
            class="relative mb-8 text-2xl font-bold tracking-wide after:absolute after:-bottom-2 after:left-0 after:h-[1px] after:w-full after:bg-gray-600 after:content-['']"
          >
            プライバシーポリシー
          </h1>
          <p class="mb-5 text-sm">
            本ウェブサイト管理者（以下、「管理者」といいます。）は、本ウェブサイト上で提供するサービス（以下、「本サービス」といいます。）における、ユーザーの個人情報の取扱いについて、以下のとおりプライバシーポリシー（以下、「本ポリシー」といいます。）を定めます。
          </p>
          <ul class="grid gap-6">
            <div
              v-for="privacyPolicyItem in privacyPolicyItems"
              :key="privacyPolicyItem.id"
            >
              <p class="mb-1 font-bold">
                {{ privacyPolicyItem.ttl }}
              </p>
              <p class="text-sm" v-html="privacyPolicyItem.txt" />
            </div>
          </ul>
        </div>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
type PrivacyPolicyItem = {
  id: number;
  ttl: string;
  txt: string;
};

const privacyPolicyItems = ref<PrivacyPolicyItem[]>([
  {
    id: 1,
    ttl: "第1条（プライバシー情報の定義）",
    txt: "プライバシー情報とは、個人情報、履歴情報および特性情報をいいます。<br /><br />プライバシー情報のうち「個人情報」とは、個人情報保護法にいう「個人情報」を指すものとし、生存する個人に関する情報であって、当該情報に含まれる氏名、連絡先その他の記述等により特定の個人を識別できる情報を指します。<br /><br />プライバシー情報のうち「履歴情報および特性情報」とは、上記に定める「個人情報」以外のものを指し、ご利用いただいたサービスやご覧になったページ、広告の履歴、ユーザーが検索された検索キーワード、ご利用日時、ご利用方法、ご利用環境、登録ユーザーのIPアドレス、Cookie、端末の個体識別情報等、ユーザーがサービスを利用する際の履歴に関する情報や、ユーザーの有する特性に関する情報を指します。",
  },
  {
    id: 2,
    ttl: "第2条（プライバシー情報の収集方法）",
    txt: "本サービスは、アカウントの有効性の確認やアカウントの保護のため、ユーザーが利用登録をする際に、氏名、メールアドレス等のプライバシー情報をお尋ねすることがあります。また、ユーザーと本サービスの提携先（情報提供元、広告主、広告配信先等を含みます）等との間でなされたユーザーのプライバシー情報を含む取引記録や、決済に関する情報を本サービスの提携先等から収集することがあります。<br /><br />本サービスは、利便性の向上のため、ユーザーのご利用したサービスやソフトウェア、閲覧したページや広告の履歴、検索した検索キーワード、ご利用日時、ご利用方法、ご利用環境（携帯端末を通じてご利用の場合の当該端末の通信状態、利用に際しての各種設定情報等も含みます）、IPアドレス、Cookie、ローカルストレージ等の履歴情報および特性情報を、ユーザーが本サービスや提携先のサービスを利用し、またはページを閲覧する際に収集します。<br /><br />本サービスは、ユーザーへ売上の振込を行うために、振込先の口座情報をお尋ねすることがあります。<br /><br />本サービスは、ユーザーが利用登録する際に、本人確認書類（運転免許証等）のご提出をお願いすることがあります。",
  },
  {
    id: 3,
    ttl: "第3条（個人情報を収集・利用する目的）",
    txt: "管理者が個人情報を収集・利用する目的は以下のとおりです。<br /><br />1. 本サービスの提供・運営のため<br />2. ユーザーに自身の登録情報の閲覧や修正、利用状況の閲覧を行っていただくため<br />3. ユーザーがサービスを提供する顧客に対して、情報開示を行なっていただくため<br />4. ユーザーからのお問い合わせに回答するため（本人確認を行うことを含む）<br />5. ユーザーにお知らせや連絡をするため<br />6. ユーザーへ売上をお支払いするため<br />7. ユーザーへ決済手数料をご請求するため<br />8. 本サービスのサービス向上のための調査、分析をするため<br />9. 管理者からのサービスやセミナー等のご案内を電子メール等でお送りするため<br />10. 本サービスの不正利用の防止及び不正利用発生時の対応のため<br />11. 上記の利用目的に付随する目的",
  },
  {
    id: 4,
    ttl: "第4条（利用目的の変更）",
    txt: "管理者は、利用目的が変更前と関連性を有すると合理的に認められる場合に限り、個人情報の利用目的を変更するものとします。<br />利用目的の変更を行った場合には、変更後の目的について、管理者所定の方法により、ユーザーに通知、または本ウェブサイト上に公表するものとします。",
  },
  {
    id: 5,
    ttl: "第5条（個人情報の適正な取得）",
    txt: "管理者は、適正に個人情報を取得し、偽りその他不正の手段により取得しません。",
  },
  {
    id: 6,
    ttl: "第6条（個人情報の安全管理）",
    txt: "管理者は、個人情報の紛失、破壊、改ざん及び漏洩等のリスクに対して、適切な個人情報の安全管理を行います。また、管理者は、個人情報の取扱いの全部又は一部を委託する場合は、委託先において個人情報の安全管理が図られるよう、必要かつ適切な監督を行います。",
  },
  {
    id: 7,
    ttl: "第7条（個人情報の第三者提供）",
    txt: "管理者は、次に掲げる場合を除いて、予めユーザーの同意を得ることなく、第三者に個人情報を提供することはありません。<br /><br />1. 法令に基づく場合<br />2. 人の生命、身体又は財産の保護のために必要がある場合であって、ユーザーの同意を得ることが困難であるとき<br />3. 公衆衛生の向上又は児童の健全な育成の推進のために特に必要がある場合であって、ユーザーの同意を得ることが困難であるとき<br />4. 国の機関もしくは地方公共団体又はその委託を受けた者が法令の定める事務を遂行することに対して協力する必要がある場合であって、ユーザーの同意を得ることにより当該事務の遂行に支障を及ぼすおそれがあるとき<br /><br />前項の定めにかかわらず、次に掲げる場合は当該情報の提供先は第三者に該当しないものとします。<br /><br />5. 管理者が利用目的の達成に必要な範囲内において個人情報の取扱いの全部または一部を委託する場合<br />6. 合併その他の事由による事業の承継に伴って個人情報が提供される場合<br />7. 個人情報保護法の定めに基づき共同利用する場合<br /><br />本サービスでは、コンテンツの決済をStripe Inc.に委託しています。本サービスの決済手数料等の請求先に関するメールアドレス、クレジットカード情報およびモバイル決済情報の取り扱いに関しては<a class='text-[#0f83fd]' href='https://stripe.com/jp/privacy' target='_blank' rel='nofollow noopener noreferrer'>Stripe Inc.のプライバシーポリシー</a>が適用されます。<br /><br />また、本サービスでは利用状況を把握し、サービスを改善するためにGoogle LLCが提供するGoogle Analyticsを利用しています。Google Analyticsは閲覧ページ毎のアクセス回数や滞在時間、利用環境や地域毎の利用者数、流入経路や検索語句等を分析する機能を提供しています。Google AnalyticsにはCookieなどデバイスに記録されている識別子や、IPアドレス、閲覧したサイトのURLやアプリの画面名等の情報が送信されます。Google Analyticsに関する詳しい説明は<a class='text-[#0f83fd]' href='https://policies.google.com/technologies/ads?gl=jp' target='_blank' rel='nofollow noopener noreferrer'>Googleのサービスを使用するサイトやアプリから収集した情報Googleによる使用</a>をご覧ください。",
  },
  {
    id: 8,
    ttl: "第8条（個人情報の開示）",
    txt: "管理者は、ユーザー本人から個人情報の開示を求められたときは、ユーザー本人に対し遅滞なくこれを開示します。ただし、開示することにより次のいずれかに該当する場合は、その全部または一部を開示しないこともあり、開示しない決定をした場合にはその旨を遅滞なく通知します。<br /><br />1. ユーザー本人または第三者の生命、身体、財産その他の権利利益を害するおそれがある場合<br />2. 管理者の業務の適正な実施に著しい支障を及ぼすおそれがある場合<br />3. その他法令に違反することとなる場合<br /><br />前項の定めにかかわらず、履歴情報および特性情報等、個人情報以外の情報については原則として開示いたしません。",
  },
  {
    id: 9,
    ttl: "第9条（個人情報の訂正および削除）",
    txt: "ユーザーは、管理者の保有する自己の個人情報が誤った情報である場合には、個人情報の訂正、追加または削除（以下「訂正等」といいます）を請求することができます。<br />管理者は、ユーザーから前項の請求を受けてその請求に応じる必要があると判断した場合には、遅滞なく、当該個人情報の訂正等を行うものとします。<br />管理者は、前項の規定に基づき訂正等を行った場合、または個人情報保護法その他の法令により訂正等を行わない旨の決定をしたときは遅滞なく、これをユーザーに通知します。",
  },
  {
    id: 10,
    ttl: "第10条（個人情報の利用停止等）",
    txt: "ユーザーは、ユーザー本人の個人情報が「あらかじめ公表された利用目的の範囲を超えて取り扱われているという理由」又は「偽りその他不正の手段により取得されたものであるという理由」により、個人情報保護法の定めに基づきその利用の停止又は消去（以下「利用停止等」といいます）を求めることができます。 管理者は、ユーザーから前項の請求を受けて、そのご請求に理由があることが判明した場合には、本人からのご請求であることを確認の上で、遅滞なく個人情報の利用停止等を行い、その旨をユーザーに通知します。但し、個人情報保護法その他の法令により、管理者が利用停止等の義務を負わない場合は、この限りではありません。",
  },
  {
    id: 11,
    ttl: "第11条（継続的改善）",
    txt: "管理者は、個人情報の取り扱いに関する運用状況を適宜見直し、継続的な改善に努めるものとし、必要に応じて、プライバシーポリシーを変更することがあります。本ポリシーの内容は、法令その他本ポリシーに別段の定めのある事項を除いて、ユーザーに通知することなく変更することができるものとします。<br />変更後のプライバシーポリシーは、本ウェブサイトに掲載したときから効力を生じるものとします。",
  },
  {
    id: 12,
    ttl: "第12条（お問い合わせ窓口）",
    txt: "開示等のお申出、ご意見、ご質問、苦情、その他個人情報の取り扱いに関するお問い合わせは、下記の窓口までお願いいたします。<br />Eメールアドレス：luggo.register@gmail.com",
  },
]);

useHead({
  title: "プライバシーポリシー",
  meta: [
    {
      name: "description",
      content: "プライバシーポリシー",
    },
    {
      key: "og:url",
      property: "og:url",
      content: "#",
    },
    {
      key: "og:title",
      property: "og:title",
      content: "プライバシーポリシー | LugGo(ラグゴー)",
    },
    {
      key: "og:description",
      property: "og:description",
      content: "プライバシーポリシーページです。",
    },
    {
      key: "twitter:title",
      name: "twitter:title",
      content: "プライバシーポリシー | LugGo(ラグゴー)",
    },
    {
      key: "twitter:description",
      name: "twitter:description",
      content: "プライバシーポリシーページです。",
    },
  ],
});

// useJsonld(() => [
//   {
//     "@context": "https://schema.org",
//     "@type": "BreadcrumbList",
//     itemListElement: [
//       {
//         "@type": "ListItem",
//         position: 1,
//         item: "",
//         name: "トップ",
//       },
//       {
//         "@type": "ListItem",
//         position: 2,
//         item: "",
//         name: "プライバシーポリシー",
//       },
//     ],
//   },
// ]);
</script>
